app/views/readings/_show.html.haml

-@book.readings.each do |r|
  .reading
---
SELECT `readings`.* FROM `readings` WHERE (`readings`.book_id = 219)