app/views/readings/_show.haml

SELECT `readings`.* FROM `readings` WHERE (`readings`.book_id = 1)
---
-@book.readings.each do |r|
  .reading