app/views/readings/show.html.haml

%h2= link_to @reading.book.title, book_path(@reading.book)
%h3= link_to @reading.book.authorships.first.author.fullname, author_path(@reading.book.authorships.first.author)
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 113 LIMIT 1
SELECT `authorships`.* FROM `authorships` WHERE (`authorships`.book_id = 2) LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1