app/views/authors/show.haml

%ul
-@author.books.each do |book|
---
SELECT `books`.* FROM `books` INNER JOIN `authorships` ON `books`.id = `authorships`.book_id WHERE ((`authorships`.author_id = 183))