app/views/books/edit.html.haml

-form_for @book do |f|
  %p #{f.label :author_tokens, "Authors:"}<br />#{f.text_field :author_tokens, "data-pre" => @book.authors.map(&:json_attributes).to_json }
---
SELECT `authors`.* FROM `authors` INNER JOIN `authorships` ON `authors`.id = `authorships`.author_id WHERE ((`authorships`.book_id = 568))