app/views/books/index.html.haml

SELECT `authorships`.* FROM `authorships` WHERE (`authorships`.book_id = 6)
---
		%h3.title=link_to book.title, book
		-book.authorships.each do |a|