app/views/books/index.haml

		%h3.title=link_to book.title, book
		-book.authorships.each do |a|
---
SELECT `authorships`.* FROM `authorships` WHERE (`authorships`.book_id = 605)