app/views/books/show.haml

SELECT `authorships`.* FROM `authorships` WHERE (`authorships`.book_id = 1)
---
- @book.authors.each do |author|
	-if author.authorships.find_by_book_id(@book.id).translator == 1