app/controllers/authors_controller.rb

  def index
    @authors = Author.where("author_first like ? or author_last like ?", "%#{params[:q]}%", "%#{params[:q]}%")
    # @authors = Author.paginate :page=>params[:page]
    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => @authors }
      format.json { render :json => @authors.map(&:json_attributes) }
---
SELECT `authors`.* FROM `authors` WHERE (author_first like '%hemingq%' or author_last like '%hemingq%')
SELECT `authors`.* FROM `authors`

  def show
    @author = Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 183 LIMIT 1

  def edit
    @author = Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 66 LIMIT 1

  def create
    @author = Author.new(params[:author])
    # @author.name = @author.author_last
    # if @author.author_first && @author.author_first != ''
    #   @author.name = @author.author_first + " " + @author.name
    # end
    respond_to do |format|
      if @author.save
---
INSERT INTO `authors` (`other`, `author`, `author_last`, `name`, `updated_at`, `author_first`, `title`, `created_at`) VALUES (NULL, NULL, NULL, 'Richard E. Silverman', '2011-04-28 17:14:18', NULL, NULL, '2011-04-28 17:14:18')

  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 66 LIMIT 1
UPDATE `authors` SET `updated_at` = '2011-04-27 01:43:54', `name` = 'James Cracraft' WHERE `authors`.`id` = 66