app/controllers/books_controller.rb

  def index

    @books = Book.find_all_by_location_id(7)
    @unread = Book.count(:joins => "left join readings r on r.book_id = books.id", :conditions => "r.id is NULL")
---
SELECT `books`.* FROM `books` WHERE `books`.`location_id` = 7
SELECT COUNT(*) FROM `books` left join readings r on r.book_id = books.id WHERE (where r.id is NULL)
SELECT `books`.* FROM `books`

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`location_id`, `updated_at`, `pages`, `genre_id`, `publisher`, `language_id`, `ISBN`, `original_language`, `translator`, `notes`, `title`, `created_at`) VALUES (5, '2011-04-19 22:51:55', 255, 17, 'Our Sunday Visitor', 4, '9781592767878', NULL, NULL, '', 'The Godless Delusion: A Catholic Challenge to Modern Atheism', '2011-04-19 22:51:55')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 300 LIMIT 1
UPDATE `books` SET `notes` = 'Originally assigned reading for a Russian culture class taught by Dr. Joan Pratt, circa 1996.', `ISBN` = '', `location_id` = 10, `genre_id` = 8 WHERE `books`.`id` = 300