app/controllers/readings_controller.rb

  def index
    @readings = Reading.all
---
SELECT `readings`.* FROM `readings`

  def show
    @book = Book.find(params[:book_id])
    @reading = @book.readings.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT `readings`.* FROM `readings` WHERE `readings`.`id` = 233 AND (`readings`.book_id = 102) LIMIT 1

  def new
    @book = Book.find(params[:book_id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 102 LIMIT 1

  def edit
    @book = Book.find(params[:book_id])
    @reading = @book.readings.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT `readings`.* FROM `readings` WHERE `readings`.`id` = 214 AND (`readings`.book_id = 219) LIMIT 1

  def create
    @book = Book.find(params[:book_id])
    @reading = @book.readings.new(reading_params)

    respond_to do |format|
      if @reading.save
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 102 LIMIT 1
INSERT INTO `readings` (`date_finished`, `rating`, `last_modified`, `date_started`, `comments`, `book_id`) VALUES ('2006-01-01', 6, '2011-04-15', '2006-01-01', 'Indispensable for the study of Fontane\'s works. Read first while in Germany for the Fontane course (with Dr. Tebbin, if I remember correctly), but I regularly break it out whenever I start one of Fontane\'s novels.', 85)

  def update
    @book = Book.find(params[:book_id])
    @reading = @book.readings.find(params[:id])

    respond_to do |format|
      if @reading.update_attributes(reading_params)
---
SELECT `readings`.* FROM `readings` WHERE `readings`.`id` = 2 LIMIT 1
UPDATE `readings` SET `updated_on` = '2011-04-18 16:24:04', `comments` = 'Bit dry, and unfortunatley, I don\'t have enough historical context for all the work on Algeria.' WHERE `readings`.`id` = 216